app/Controllers/AuthController.php

    public function process()
    {
        $penggunaModel = new PenggunaModel();
        $session = session();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $penggunaModel->where('username', $username)->first();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'admin'
 LIMIT 1