app/Controllers/KomponenGajiController.php

    public function index()
    {
        // Proteksi halaman, hanya admin yang boleh akses
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/dashboard');
        }

        $komponenGajiModel = new KomponenGajiModel();

        $data = [
            'title'        => 'Data Komponen Gaji',
            'komponen_gaji' => $komponenGajiModel->findAll()
---
SELECT *
FROM `komponen_gaji`