app/Controllers/PenggajianController.php

    public function index()
    {
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/dashboard');
        }

        $penggajianModel = new PenggajianModel();

        $data = [
            'title' => 'Data Penggajian',
            // Kita buat query JOIN di sini untuk mengambil nama anggota dan komponen
            'penggajian' => $penggajianModel->select('penggajian.id_penggajian, anggota.nama_depan, anggota.nama_belakang, komponen_gaji.nama_komponen')
                                           ->join('anggota', 'anggota.id_anggota = penggajian.id_anggota')
                                           ->join('komponen_gaji', 'komponen_gaji.id_komponen_gaji = penggajian.id_komponen_gaji')
                                           ->findAll()
        ];
---
SELECT `penggajian`.`id_penggajian`, `anggota`.`nama_depan`, `anggota`.`nama_belakang`, `komponen_gaji`.`nama_komponen`
FROM `penggajian`
JOIN `anggota` ON `anggota`.`id_anggota` = `penggajian`.`id_anggota`
JOIN `komponen_gaji` ON `komponen_gaji`.`id_komponen_gaji` = `penggajian`.`id_komponen_gaji`

    public function simpan()
    {
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/dashboard');
        }

        $penggajianModel = new PenggajianModel();

        $penggajianModel->save([
            'id_anggota'       => $this->request->getPost('id_anggota'),
            'id_komponen_gaji' => $this->request->getPost('id_komponen_gaji')
        ]);
---
INSERT INTO `penggajian` (`id_anggota`, `id_komponen_gaji`) VALUES ('107', '201')