app/Controllers/PenggajianController.php

SELECT *
FROM `anggota`
---
    public function index()
    {
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/dashboard');
        }

        $anggotaModel = new AnggotaModel();
        $penggajianModel = new PenggajianModel();

        $semuaAnggota = $anggotaModel->findAll();

SELECT *
FROM `anggota`
SELECT *
FROM `komponen_gaji`
---
    public function tambah()
    {
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/dashboard');
        }

        $anggotaModel = new AnggotaModel();
        $komponenGajiModel = new KomponenGajiModel();

        $data = [
            'title'    => 'Tambah Data Penggajian',
            'anggota'  => $anggotaModel->findAll(),
            'komponen' => $komponenGajiModel->findAll()

SELECT *
FROM `penggajian`
WHERE `id_anggota` = '107'
DELETE FROM `penggajian`
WHERE `id_penggajian` IN ('74')
---
    public function hapusSemua($id_anggota)
    {
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/dashboard');
        }

        $penggajianModel = new PenggajianModel();

        // Langkah 1: Temukan semua data penggajian yang cocok
        $dataUntukDihapus = $penggajianModel->where('id_anggota', $id_anggota)->findAll();

        // Langkah 2: Jika ada datanya, loop dan hapus satu per satu berdasarkan primary key-nya
        if (!empty($dataUntukDihapus)) {
            foreach ($dataUntukDihapus as $item) {
                // Hapus berdasarkan id_penggajian (primary key dari tabel penggajian)
                $penggajianModel->delete($item['id_penggajian']);