app/Controllers/PublicController.php

    public function anggota()
    {
        $anggotaModel = new AnggotaModel();

        $data = [
            'title'   => 'Data Anggota DPR',
            'anggota' => $anggotaModel->findAll()
        ];
---
SELECT *
FROM `anggota`