app/Models/PenggajianModel.php

SELECT *
FROM `penggajian`
JOIN `komponen_gaji` ON `komponen_gaji`.`id_komponen_gaji` = `penggajian`.`id_komponen_gaji`
WHERE `penggajian`.`id_anggota` = '101'
---
    public function getKomponenByAnggota($id_anggota)
    {
        return $this->db->table('penggajian')
            ->join('komponen_gaji', 'komponen_gaji.id_komponen_gaji = penggajian.id_komponen_gaji')
            ->where('penggajian.id_anggota', $id_anggota)
            ->get()->getResultArray();